## [DataFrame에 행/열 추가하기]

(1) Module Loading----------------------------------------------------------

In [2]:
import pandas as pd

(2) Preparing Data--------------------------------------------------------

In [10]:
#dict 타입의 데이터 준비
exam = {'이름':['김박복병벽','콸콸이','휴지','뢴트게늄'],
       '국어':[98,79,99,100],
       '미술':[100,55,11,25],
       '과학':[77,99,44,55],
       '수학':[88,77,99,56]}

In [11]:
examDF = pd.DataFrame(exam)

(4) 저장된 데이터 속성 확인<hr>

In [19]:
def printattribute(df,dfname):
    print(f'{dfname} attributes')
    print(f'index\n-->{examDF.index}')
    print(f'columns\n-->{examDF.columns}')
    print(f'shape\n-->{examDF.shape}')
    print(f'ndim\n-->{examDF.ndim}')

In [20]:
printattribute(examDF,'examDF')

examDF attributes
index
-->RangeIndex(start=0, stop=4, step=1)
columns
-->Index(['이름', '국어', '미술', '과학', '수학'], dtype='object')
shape
-->(4, 5)
ndim
-->2

(5)DataFrame에 Column 추가<hr>
 - 방법: DF객체변수명[새로운 컬럼 이름] = 값

In [21]:
index = (['이름'], ['국어'], ['미술'], ['과학'],['수학'])

In [22]:
examDF['영어']=[90,89,100,70] #행 갯수만큼 값 추가

In [23]:
examDF

      이름   국어   미술  과학  수학   영어
0  김박복병벽   98  100  77  88   90
1    콸콸이   79   55  99  77   89
2     휴지   99   11  44  99  100
3   뢴트게늄  100   25  55  56   70

In [30]:
examDF['사회']=10 #컬럼에 추가할 정보를 하나만 입력하면 열 전체에 같은 값을 할당함

In [32]:
examDF.columns

Index(['이름', '국어', '미술', '과학', '수학', '영어', '사화', '사회'], dtype='object')

(6) DataFrame에 행(row) 추가하기<hr>
- 방법: DF객체변수명.loc[새로운 행 인덱스 이름]=[데이터(컬럼 수만큼)]
- 방법: DF객체변수명.loc[새로운 행 인덱스 이름]=[데이터]
- 방법: DF객체변수명.iloc[새로운 행 인덱스 이름]=[데이터]<얘는 안 됨: 데이터가 존재해야 인덱스가 할당되기 때문

In [33]:
examDF.index

RangeIndex(start=0, stop=4, step=1)

In [36]:
#컬럼 수만큼의 데이터를 가진 행 추가
examDF.loc[4] = ['Ine',1,2,3,4,5,6,7]

In [37]:
examDF

      이름   국어   미술  과학  수학   영어  사화  사회
0  김박복병벽   98  100  10  88   90  10  10
1    콸콸이   79   55  10  77   89  10  10
2     휴지   99   11  10  99  100  10  10
3   뢴트게늄  100   25  10  56   70  10  10
4    Ine    1    2   3   4    5   6   7

In [40]:
examDF.iloc[5] = ['Lilpa',1,2,3,4,5,6,7]# <<행 추가시 iloc 사용불가: 데이터 수에 맞게 인덱스 범위가 지정되기 때문, 현재 없는 인덱스를 지정하므로 불가함

In [41]:
examDF

      이름   국어   미술  과학  수학   영어  사화  사회
0  김박복병벽   98  100  10  88   90  10  10
1    콸콸이   79   55  10  77   89  10  10
2     휴지   99   11  10  99  100  10  10
3   뢴트게늄  100   25  10  56   70  10  10
4    Ine    1    2   3   4    5   6   7
5  Lilpa    1    2   3   4    5   6   7

In [42]:
#1개의 데이터 가진 행 추가
examDF.loc[5] = 'JingBurGer'
examDF

,이름,국어,미술,과학,수학,영어,사화,사회
0,김박복병벽,98,100,10,88,90,10,10
1,콸콸이,79,55,10,77,89,10,10
2,휴지,99,11,10,99,100,10,10
3,뢴트게늄,100,25,10,56,70,10,10
4,Ine,1,2,3,4,5,6,7
5,JingBurGer,JingBurGer,JingBurGer,JingBurGer,JingBurGer,JingBurGer,JingBurGer,JingBurGer